{"contact_location":"İran / Mazenderan / Babolsar","contact_phone":"+98-936-159-9686","contact_title":"Bana ulaşın","email_label":"E-posta Adresi","freelancer_paragraph":"Serbest çalışan, genellikle bağımsız bir yüklenici olarak kısa süreli çalışma için iş başına veya görev başına para kazanan bir kişidir. Bir serbest meslek sahibi, bir firmanın çalışanı değildir ve bu nedenle, belirli bir proje tamamlanana kadar sözleşmeye bağlı olarak münhasıran çalışmayı taahhüt etmedikçe, çeşitli kişiler veya firmalar tarafından aynı anda farklı işleri tamamlama özgürlüğüne sahip olabilir.","freelancer_title":"Serbest Çalışan Kimdir?","full_name_label":"Ad Soyad","hero_title":"Çevrimiçi Hayallerinizi Hayata Geçirin","javascript_paragraph":"JavaScript, web geliştiricilerinin web sayfaları, uygulamalar, sunucular ve hatta oyunlar geliştirirken daha dinamik etkileşimler oluşturmak için yaygın olarak kullandıkları hafif bir programlama dilidir.","javascript_title_1":"JavaScript Nedir?","message_label":"İleti","navbar_contact":"Bana ulaşın","navbar_freelancer":"Serbest çalışan","navbar_home":"Ev","navbar_javascript":"JavaScript","navbar_projects":"Projeler","projects_desc_realtor_app":"Bu <a\n  href=\"https://www.udemy.com/course/the-nest-js-bootcamp-complete-developer-guide/\"\n  target=\"_blank\"\n><strong>, The Nest JS Bootcamp - Eksiksiz Geliştirici Kılavuzu</strong> Kursu'ndan bir uygulama projesidir.</a> <a\n  href=\"https://www.realtor.com\"\n  target=\"_blank\"\n>Realtor.com</a> <a\n  href=\"https://www.udemy.com/course/the-nest-js-bootcamp-complete-developer-guide/\"\n  target=\"_blank\"\n>gibi Realtor uygulamasının basit bir API tarafı</a> , kullanıcıların evlerini göstermek ve satmak için emlakçı olarak kaydolabileceği ve alıcı olarak diğer kullanıcıların belirli evi satın almak için emlakçılara mesaj göndermek için kaydolabileceği.<br /> Bu çok basit bir uygulamaydı ancak NestJS çerçevesinin farklı bölümleri hakkında çok şey öğretiyor: ORM Entegrasyonu, Ara Yazılım, Durdurucular, Muhafızlar, Dekoratörler, Param Dekoratörleri, Entegrasyon Testi vb.<br /> API dokümantasyonu için Swagger'ı da öğrendim ve bu projeye başvurdum.","projects_title":"Benim projelerim","send_message_title":"Mesaj gönder","sub_heading":"React.js ve Node.js ile Hızlı Web Uygulamaları Oluşturun","typescript_paragraph":"TypeScript, modern bir JavaScript geliştirme dilidir. Açık ve basit JavaScript kodu yazmak için statik olarak derlenmiş bir dildir. Node js veya herhangi bir tarayıcıda çalıştırılabilir. TypeScript, isteğe bağlı statik yazma, sınıflar ve arabirim sağlar. TypeScript'i benimseyen büyük bir JavaScript projesi için size daha sağlam bir yazılım getirebilir ve normal bir JavaScript uygulamasıyla kolayca konuşlandırılabilir.","typescript_title":"TypeScript Nedir?"}