{"about_text_1":"My name is Arvin Ramezani. I am 30 years old and live in Babolsar, Mazandaran, Iran.","about_text_2":"I began learning web development in August 2020 through Persian online tutorials and YouTube. Since then, I have expanded my knowledge by taking online courses on platforms like Udemy, with a particular focus on Academind courses.","about_text_3":"My goal is to become a full-stack developer specializing in JavaScript and TypeScript.","about_title":"About Me","footer_contact":"Contact","footer_location_text":"Iran / Mazandaran / Babolsar","footer_send_email_title":"Send Email","hero_section_heading":"Bring your online dreams to life","hero_section_sub_heading":"FAST WEB APPLICATIONS WITH REACT.JS AND NODE.JS\n\n","projects_desc_pizza_shop":"This is a practice project which I create after watching <a href=\"https://www.udemy.com/course/nextjs-react-the-complete-guide/\" target=\"_bland\">NextJS Academind Course</a> to practice what I learned in the course. \n(File Upload, Authentication and Authorization, Form validation using react-hook-form and yup).\n<br />\nI used next-auth for authentication.\n<br />\nI learned a lot about animations with framer-motion and how it works together with styled-components to create reusable components.\n<br />\nI was already familiar with redux-toolkit but had not used RTK Query before. I practiced using it in NextJS in this project, also I practiced how to work with Map API (Mapbox).","projects_desc_realtor_app":"This is a practice project from \n<a\n  href=\"https://www.udemy.com/course/the-nest-js-bootcamp-complete-developer-guide/\"\n  target=\"_blank\"\n>\n  <strong>The Nest JS Bootcamp - Complete Developer Guide</strong> \n  Course. A simple API side of Realtor app like \n</a>\n<a\n  href=\"https://www.realtor.com\"\n  target=\"_blank\"\n>\n  Realtor.com\n</a>\n, where users can signup as realtor to show and sell their homes, and\nother users as buyers can signup for message to realtors to buy the\nspecific house.\n<br />\nThis was very simple app but teaches a lot about different parts of\nNestJS framework like: ORM Integration, Middleware, Interceptors,\nGuards, Decorators, Param Decorators, Integration Testing and so on.\n<br />I also learned Swagger for API documentation and apply to this\nproject.","projects_title":"My Projects","projects_video_modal_notice_problem":"  If you have IDM (Internet Download Manager) installed on your\n                system it might try to download the video automatically and\n                prevent the browser to show video correctly!","projects_video_modal_notice_solution":"You can solve this click on cancel button in IDM and select the\n                \"Cancel auto downloading from this site\" option.","skill_name_nextjs":"NextJS","skill_name_nodejs":"NodeJS","skills_title":"Skills"}